title: RM2000001 - Get File Details - Splunk - Inline
id: RM2000001_splunk
description: Show a file Details in Splunk using Inline Scripts
author: martin connarty
creation_date: 2023/03/07
stage: identification
references:
  - null
type: inline
methods:
-
  title: Get from CIM Endpoint model in splunk
  method: >
      `Cim_Endpoint_Indexes` | eval File_Name=coalesce(File_Name, FileName) |
      table _time File_Name
-
  title: Get from Data model in splunk
  method: >
    | tstats count from datamodel=Endpoint by ....
